# ONLINE RETAIL

In [78]:
import pandas as pd
import numpy as np

In [79]:
df = pd.read_csv('OnlineRetail.csv', encoding='latin-1')
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [80]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

541.909 rows & 8 columns

In [81]:
df.shape

(541909, 8)

Column detail

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

"Description": 1.454 null values 
"CustomerID": 135.080 null values

In [83]:
df.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [84]:
df.describe().round(2)

        Quantity  UnitPrice  CustomerID
count  541909.00  541909.00   406829.00
mean        9.55       4.61    15287.69
std       218.08      96.76     1713.60
min    -80995.00  -11062.06    12346.00
25%         1.00       1.25    13953.00
50%         3.00       2.08    15152.00
75%        10.00       4.13    16791.00
max     80995.00   38970.00    18287.00

In [85]:
df["Total Revenue"] = df["Quantity"]* df["UnitPrice"]
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Total Revenue
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,20.34

'UnitPrice' = zero value. 
As itÂ´s not correct send out invoices with zero values and any exception itÂ´s not specified, IÂ´ve removed these rows from dataset.

In [86]:
retail = df[df['UnitPrice']!= 0]

New dataset : 539394 rows & 8 columns

In [87]:
retail.shape

(539394, 9)

# INVOICES
Filter by column 'InvoiceNo', values startswith('5')

In [88]:
orders = retail[retail['InvoiceNo'].astype(str).str.startswith('5')]

In [128]:
print("Total no. of invoices:", orders['InvoiceNo'].nunique())
print("No. of products sold:",orders['Quantity'].sum())
print("Total invoiced:",orders['Total Revenue'].sum().round(2))
print("No. of customers:", retail['CustomerID'].nunique())

Total no. of invoices: 19959
No. of products sold: 5588375
Total invoiced: 10655622.48
No. of customers: 4371

# CREDIT NOTES
Filter by column 'InvoiceNo', values startswith('C')

In [91]:
cancelled_orders = retail[retail['InvoiceNo'].astype(str).str.startswith('C')]
cancelled_orders.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Total Revenue
141,C536379,D,Discount,-1,12/1/2010 9:41,27.50,14527.0,United Kingdom,-27.50
154,C536383,35004C,SET OF 3 COLOURED FLYING DUCKS,-1,12/1/2010 9:49,4.65,15311.0,United Kingdom,-4.65
235,C536391,22556,PLASTERS IN TIN CIRCUS PARADE,-12,12/1/2010 10:24,1.65,17548.0,United Kingdom,-19.80
236,C536391,21984,PACK OF 12 PINK PAISLEY TISSUES,-24,12/1/2010 10:24,0.29,17548.0,United Kingdom,-6.96
237,C536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,-24,12/1/2010 10:24,0.29,17548.0,United Kingdom,-6.96

In [101]:
print("Total no. of credit notes:", cancelled_orders['InvoiceNo'].nunique())
print("No. of products returned:",cancelled_orders['Quantity'].sum())
print("Total credited:",cancelled_orders['Total Revenue'].sum().round(2))

Total no. of credit notes: 3836
No. of products returned: -277574
Total credited: -896812.49

RETURNED PRODUCTS.( order ascending)

In [94]:
cancelled_orders.groupby("Description")["Quantity"].sum().sort_values(ascending = True)

Description
PAPER CRAFT , LITTLE BIRDIE           -80995
MEDIUM CERAMIC TOP STORAGE JAR        -74494
ROTATING SILVER ANGELS T-LIGHT HLDR    -9376
Manual                                 -4066
FAIRY CAKE FLANNEL ASSORTED COLOUR     -3150
                                       ...
DECORATIVE CATS BATHROOM BOTTLE           -1
SET OF 6 T-LIGHTS CACTI                   -1
GEORGIAN TRINKET BOX                      -1
CURIO CABINET LINEN AND LACE              -1
RED DRAGONFLY HELICOPTER                  -1
Name: Quantity, Length: 1972, dtype: int64

TOTAL ADJUSTS. 'InvoiceNo'= contains('A')

In [102]:
adjust = retail[retail['InvoiceNo'].astype(str).str.contains('A')]
adjust.head()
print("Total adjusts for bad debts:",len(adjust))
print("Total Adjusts:",adjust['Total Revenue'].sum().round(2))

Total adjusts for bad debts: 3
Total Adjusts: -11062.06

AVERAGE ORDER PRICE

In [110]:
round(orders.groupby("InvoiceNo")["UnitPrice"].sum().mean(),2)

103.23

In [104]:
orders.groupby("InvoiceNo")["UnitPrice"].sum().sort_values(ascending = False)

InvoiceNo
537632    13541.33
551697     8142.75
573585     7031.36
562955     6688.05
571751     6068.06
            ...
546390        0.12
567869        0.08
559166        0.06
544152        0.06
560599        0.06
Name: UnitPrice, Length: 19959, dtype: float64

# DATE
Change type value ["InvoiceDate"] from object to datetime

In [111]:
retail.set_index("InvoiceDate", inplace= True)

In [112]:
retail.index = pd.to_datetime(retail.index)
retail.head()

,InvoiceNo,StockCode,Description,Quantity,UnitPrice,CustomerID,Country,Total Revenue
InvoiceDate,,,,,,,,
2010-12-01 08:26:00,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2.55,17850.0,United Kingdom,15.30
2010-12-01 08:26:00,536365,71053,WHITE METAL LANTERN,6,3.39,17850.0,United Kingdom,20.34
2010-12-01 08:26:00,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2.75,17850.0,United Kingdom,22.00
2010-12-01 08:26:00,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,3.39,17850.0,United Kingdom,20.34
2010-12-01 08:26:00,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,3.39,17850.0,United Kingdom,20.34

In [113]:
retail.resample("M").count()

,InvoiceNo,StockCode,Description,Quantity,UnitPrice,CustomerID,Country,Total Revenue
InvoiceDate,,,,,,,,
2010-12-31,42208,42208,42208,42208,42208,26847,42208,42208
2011-01-31,35007,35007,35007,35007,35007,21909,35007,35007
2011-02-28,27580,27580,27580,27580,27580,20362,27580,27580
2011-03-31,36502,36502,36502,36502,36502,27820,36502,36502
2011-04-30,29655,29655,29655,29655,29655,23196,29655,29655
2011-05-31,36785,36785,36785,36785,36785,28906,36785,36785
2011-06-30,36688,36688,36688,36688,36688,27836,36688,36688
2011-07-31,39330,39330,39330,39330,39330,27500,39330,39330
2011-08-31,35153,35153,35153,35153,35153,27656,35153,35153
2011-09-30,50066,50066,50066,50066,50066,40820,50066,50066
2011-10-31,60504,60504,60504,60504,60504,50692,60504,60504
2011-11-30,84445,84445,84445,84445,84445,65584,84445,84445
2011-12-31,25471,25471,25471,25471,25471,17661,25471,25471

NO. OF PRODUCTS SOLD BY MONTH

In [119]:
retail.resample("M").sum()["Quantity"]

InvoiceDate
2010-12-31    343197
2011-01-31    307940
2011-02-28    280684
2011-03-31    372131
2011-04-30    295170
2011-05-31    389870
2011-06-30    381851
2011-07-31    395731
2011-08-31    409426
2011-09-30    563391
2011-10-31    598860
2011-11-30    741886
2011-12-31    230667
Freq: M, Name: Quantity, dtype: int64

TOTAL REVENUE BY MONTH

In [117]:
retail.resample("M")["Total Revenue"].sum().round(2)

InvoiceDate
2010-12-31     748957.02
2011-01-31     560000.26
2011-02-28     498062.65
2011-03-31     683267.08
2011-04-30     493207.12
2011-05-31     723333.51
2011-06-30     691123.12
2011-07-31     681300.11
2011-08-31     682680.51
2011-09-30    1019687.62
2011-10-31    1070704.67
2011-11-30    1461756.25
2011-12-31     433668.01
Freq: M, Name: Total Revenue, dtype: float64

November was the month with the highest turnover

In [121]:
retail.resample("M")["Total Revenue"].sum().round(2).max()

1461756.25

BEST SELLER RANK. ( top 20 products)

In [122]:
retail.groupby("Description")["Quantity"].sum().sort_values(ascending = False).head(20)

Description
WORLD WAR 2 GLIDERS ASSTD DESIGNS     53847
JUMBO BAG RED RETROSPOT               47359
ASSORTED COLOUR BIRD ORNAMENT         36381
POPCORN HOLDER                        36334
PACK OF 72 RETROSPOT CAKE CASES       36039
WHITE HANGING HEART T-LIGHT HOLDER    35313
RABBIT NIGHT LIGHT                    30680
MINI PAINT SET VINTAGE                26437
PACK OF 12 LONDON TISSUES             26111
PACK OF 60 PINK PAISLEY CAKE CASES    24753
VICTORIAN GLASS HANGING T-LIGHT       23854
ASSORTED COLOURS SILK FAN             23082
BROCADE RING PURSE                    23053
RED  HARMONICA IN BOX                 21866
JUMBO BAG PINK POLKADOT               21009
SMALL POPCORN HOLDER                  20116
PAPER CHAIN KIT 50'S CHRISTMAS        18902
LUNCH BAG RED RETROSPOT               18779
60 TEATIME FAIRY CAKE CASES           18040
PARTY BUNTING                         18018
Name: Quantity, dtype: int64

# COUNTRIES 
36 countries. 
2 country values wrongly categorized: "Unspecified" & "European Community".

In [123]:
countries = retail["Country"].nunique()
countries

38

In [125]:
retail.groupby("Country").count()["Total Revenue"].sort_values(ascending = False)

Country
United Kingdom          492981
Germany                   9493
France                    8556
EIRE                      8192
Spain                     2532
Netherlands               2367
Belgium                   2069
Switzerland               2001
Portugal                  1519
Australia                 1256
Norway                    1085
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         57
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     19
Saudi Arabia                10
Name: Total Revenue, dtype: int64